# Terraform plan for production

```
Plan: 5 to add, 1 to change, 1 to destroy
```

<details>
<summary>Terraform Plan Details</summary>

```
data.local_file.cluster_jwks: Reading...
data.local_file.cluster_jwks: Read complete after 0s [id=18a5b6f817bb4271ad0ac497502ebd65d011cc1a]
module.velero.google_service_account.velero: Refreshing state... [id=projects/prd-piny940/serviceAccounts/velero@prd-piny940.iam.gserviceaccount.com]
module.velero.google_storage_bucket.velero: Refreshing state... [id=velero-cluster-backup.piny940.com]
module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=prd-piny940/iamcredentials.googleapis.com]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=terraform-remote-backend.piny940.com]
module.clubroom.google_service_account.clubroom: Refreshing state... [id=projects/prd-piny940/serviceAccounts/clubroom@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=clubroom.piny940.com]
module.kube_workload_identity.google_secret_manager_secret.home_kubernetes_cluster_jwks: Refreshing state... [id=projects/prd-piny940/secrets/home-kubernetes-cluster-jwks]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=prd-piny940/roles/owner/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=prd-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.velero.google_project_iam_member.velero_storage_object_user: Refreshing state... [id=prd-piny940/roles/storage.objectUser/serviceAccount:velero@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_project_iam_member.clubroom_storage_object_user: Refreshing state... [id=prd-piny940/roles/storage.objectUser/serviceAccount:clubroom@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_project_iam_member.clubroom_service_account_token_creator: Refreshing state... [id=prd-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:clubroom@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/clubroom@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:clubroom]
module.terraform.google_service_account_iam_member.terraform_github_actions_pull_request_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:pull_request]
module.terraform.google_iam_workload_identity_pool_provider.repo_github_actions: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/repo-github-actions]
module.terraform.google_service_account_iam_member.terraform_github_actions_env_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:production]
module.terraform.google_service_account_iam_member.terraform_github_actions_main_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:ref:refs/heads/main]
module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/home-kubernetes]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes will be updated in-place
  ~ resource "google_iam_workload_identity_pool_provider" "home_kubernetes" {
        id                                 = "projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/home-kubernetes"
        name                               = "projects/1056391010239/locations/global/workloadIdentityPools/pool/providers/home-kubernetes"
        # (9 unchanged attributes hidden)

      ~ oidc {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ jwks_json         = (sensitive value)
            # (2 unchanged attributes hidden)
        }
    }

  # module.kube_workload_identity.google_secret_manager_secret.home_kubernetes_cluster_jwks will be destroyed
  # (because google_secret_manager_secret.home_kubernetes_cluster_jwks is not in configuration)
  - resource "google_secret_manager_secret" "home_kubernetes_cluster_jwks" {
      - annotations           = {} -> null
      - create_time           = "2024-09-25T08:45:59.932436Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {
          - "environment"                = "production"
          - "goog-terraform-provisioned" = "true"
          - "service"                    = "home-cluster"
        } -> null
      - id                    = "projects/prd-piny940/secrets/home-kubernetes-cluster-jwks" -> null
      - labels                = {} -> null
      - name                  = "projects/1056391010239/secrets/home-kubernetes-cluster-jwks" -> null
      - project               = "prd-piny940" -> null
      - secret_id             = "home-kubernetes-cluster-jwks" -> null
      - terraform_labels      = {
          - "environment"                = "production"
          - "goog-terraform-provisioned" = "true"
          - "service"                    = "home-cluster"
        } -> null
      - version_aliases       = {} -> null
        # (2 unchanged attributes hidden)

      - replication {
          - auto {
            }
        }
    }

  # module.portfolio.google_project_iam_member.portfolio_storage_object_user will be created
  + resource "google_project_iam_member" "portfolio_storage_object_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prd-piny940"
      + role    = "roles/storage.objectUser"
    }

  # module.portfolio.google_project_iam_member.portfolio_workload_identity_user will be created
  + resource "google_project_iam_member" "portfolio_workload_identity_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prd-piny940"
      + role    = "roles/iam.workloadIdentityUser"
    }

  # module.portfolio.google_service_account.portfolio will be created
  + resource "google_service_account" "portfolio" {
      + account_id                   = "portfolio"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "Portfolio"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "prd-piny940"
      + unique_id                    = (known after apply)
    }

  # module.portfolio.google_service_account_iam_member.ksa_workload_identity_user will be created
  + resource "google_service_account_iam_member" "ksa_workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:portfolio"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.portfolio.google_storage_bucket.portfolio will be created
  + resource "google_storage_bucket" "portfolio" {
      + effective_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "portfolio.piny940.com"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
<!-- Sticky Pull Request CommentGCP Plan for production -->